const ordinary_container = [
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 рублей",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "10 минут геймплея",
  "100 рублей",
  "100 рублей",
  "Редкий контейнер",
];

const rare_container = [
  "шоколад милка",
  "мороженое милка",
  "чай липтон зеленый",
  "чай липтон черный",
  "детская ряженка",
  "молочный напитон",
  "мороженое самокат",
  "зеленый горошек",
  "volt cherry",
  "volt blueberry",
  "volt lime",
  "каша рисовая",
  "шоколад милка",
  "мороженое милка",
  "чай липтон зеленый",
  "чай липтон черный",
  "детская ряженка",
  "молочный напитон",
  "мороженое самокат",
  "зеленый горошек",
  "volt cherry",
  "volt blueberry",
  "volt lime",
  "каша рисовая",
  "эпический контейнер",
];

const epic_container = [
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "500 рублей",
  "1000 рублей",
  "1000 рублей",
  "1000 рублей",
  "1000 рублей",
  "5000 рублей",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "1 час геймплея",
  "6 часов геймплея",
  "6 часов геймплея",
  "6 часов геймплея",
  "6 часов геймплея",
  "Ядерная энергия (24 часа геймплея)",
  "500 танкоинов",
];

const openOrdinaryContainer = (amount) => {
  const result = {};

  for (let t = 0; t < amount; t++) {
    let prize =
      ordinary_container[Math.floor(Math.random() * ordinary_container.length)];

    if (result[prize]) {
      result[prize] += 1;
    } else {
      result[prize] = 1;
    }
  }

  return result;
};

const openRareContainer = (amount) => {
  const result = {};

  for (let t = 0; t < amount; t++) {
    let prize =
      rare_container[Math.floor(Math.random() * rare_container.length)];

    if (result[prize]) {
      result[prize] += 1;
    } else {
      result[prize] = 1;
    }
  }

  return result;
};

const openEpicContainer = (amount) => {
  const result = {};

  for (let t = 0; t < amount; t++) {
    let prize =
      epic_container[Math.floor(Math.random() * epic_container.length)];

    if (result[prize]) {
      result[prize] += 1;
    } else {
      result[prize] = 1;
    }
  }

  return result;
};

const analyzeContainer = (container) => {
  const result = {};

  for (let item of container) {
    if (!result[item]) {
      result[item] = 1;
    } else {
      result[item] += 1;
    }
  }

  for (let item of Object.keys(result)) {
    result[item] = (result[item] / container.length).toFixed(2) * 100 + "%";
  }

  return result;
};
